{"modelTopology": {"training_config": {"sample_weight_mode": null, "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adadelta", "config": {"decay": 0.0, "rho": 0.95, "lr": 1.0, "epsilon": 1e-07}}, "metrics": ["accuracy"], "loss_weights": null}, "keras_version": "2.1.5", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "filters": 32, "data_format": "channels_last", "padding": "valid", "trainable": true, "name": "conv2d_1", "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 64, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "trainable": true, "name": "conv2d_2", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "trainable": true, "name": "dense_1", "units": 128, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "trainable": true, "name": "dense_2", "units": 10, "kernel_constraint": null}}]}, "backend": "tensorflow"}, "weightsManifest": [{"weights": [{"dtype": "float32", "name": "conv2d_1/kernel", "shape": [3, 3, 1, 32]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [32]}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_2/kernel", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [64]}], "paths": ["group2-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [9216, 128]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [128]}], "paths": ["group3-shard1of2", "group3-shard2of2"]}, {"weights": [{"dtype": "float32", "name": "dense_2/kernel", "shape": [128, 10]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [10]}], "paths": ["group4-shard1of1"]}]}