{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "padding": "valid", "name": "conv2d_1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"filters": 64, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "trainable": true, "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "activation": "relu", "units": 128, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "activation": "softmax", "units": 10, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.0.6", "backend": "tensorflow"}